#include "event.h"

/*---------------------------------------------------------------------------
 * Кольцевой буфер
 *---------------------------------------------------------------------------*/

static EventMessage_t Queue[EVENT_QUEUE_SIZE];

static volatile uint8_t Head;
static volatile uint8_t Tail;
static volatile uint8_t Count;

/*---------------------------------------------------------------------------
 * Инициализация
 *---------------------------------------------------------------------------*/

void EVENT_Init(void)
{
    Head = 0;
    Tail = 0;
    Count = 0;
}

/*---------------------------------------------------------------------------
 * Очистить очередь
 *---------------------------------------------------------------------------*/

void EVENT_Clear(void)
{
    Head = 0;
    Tail = 0;
    Count = 0;
}

/*---------------------------------------------------------------------------
 * Количество сообщений
 *---------------------------------------------------------------------------*/

uint8_t EVENT_Count(void)
{
    return Count;
}

/*---------------------------------------------------------------------------
 * Есть ли сообщения
 *---------------------------------------------------------------------------*/

bool EVENT_IsAvailable(void)
{
    return (Count != 0U);
}

/*---------------------------------------------------------------------------
 * Добавить сообщение
 *---------------------------------------------------------------------------*/

bool EVENT_Push(EventId_t id, int16_t data)
{
    if (Count >= EVENT_QUEUE_SIZE)
    {
        return false;
    }

    Queue[Head].Id   = id;
    Queue[Head].Data = data;

    Head++;

    if (Head >= EVENT_QUEUE_SIZE)
    {
        Head = 0;
    }

    Count++;

    return true;
}

/*---------------------------------------------------------------------------
 * Получить сообщение
 *---------------------------------------------------------------------------*/

bool EVENT_Get(EventMessage_t *msg)
{
    if (Count == 0U)
    {
        return false;
    }

    *msg = Queue[Tail];

    Tail++;

    if (Tail >= EVENT_QUEUE_SIZE)
    {
        Tail = 0;
    }

    Count--;

    return true;
}
