/******************************************************************************
 * @file    input.h
 * @brief   Input Manager
 *
 * Объединяет кнопки и энкодер.
 * Формирует события и помещает их в Event Manager.
 *
 * Author: GPT + Алексей
 ******************************************************************************/

#ifndef INPUT_H
#define INPUT_H

#ifdef __cplusplus
extern "C"
{
#endif

/*=============================================================================
 * Public functions
 *============================================================================*/

void INPUT_Init(void);

void INPUT_Update(void);

#ifdef __cplusplus
}
#endif

#endif /* INPUT_H */
